export const emojisGrouped = {
    animal: {
        mammal: [
            "🐵", "🐒", "🦍", "🦧", "🐶", "🐕", "🦮", "🐕‍🦺", "🐩", "🐺",
            "🦊", "🦝", "🐱", "🐈", "🐈‍⬛", "🦁", "🐯", "🐅", "🐆", "🐴",
            "🐎", "🦄", "🦓", "🦌", "🦬", "🐮", "🐂", "🐃", "🐄", "🐷",
            "🐖", "🐗", "🐽", "🐏", "🐑", "🐐", "🐪", "🐫", "🦙", "🦒",
            "🐘", "🦣", "🦏", "🦛", "🐭", "🐁", "🐀", "🐹", "🐰", "🐇",
            "🐿️", "🦫", "🦔", "🦇", "🐻", "🐨", "🐼", "🦥", "🦦", "🦨",
            "🦘", "🦡", "🐾"
        ],
        bird: [
            "🦃", "🐔", "🐓", "🐣", "🐤", "🐥", "🐦", "🐧", "🕊", "🦅",
            "🦆", "🦢", "🦉", "🦤", "🪶", "🦩", "🦚", "🦜"
        ],
        amphibian_reptile: [
            "🐸", "🐊", "🐢", "🦎", "🐍", "🐲", "🐉", "🦕", "🦖"
        ],
        marine: [
            "🐳", "🐋", "🐬", "🦭", "🐟", "🐠", "🐡", "🦈", "🐙", "🐚"
        ],
        bug: [
            "🐌", "🦋", "🐛", "🐜", "🐝", "🪲", "🐞", "🦗", "🪳", "🕷️",
            "🕸️", "🦂", "🦟", "🪰", "🪱", "🦠"
        ]
    },
    plant: {
        flower: [
            "💐", "🌸", "💮", "🏵️", "🌹", "🥀", "🌺", "🌻", "🌼", "🌷"
        ],
        other: [
            "🌱", "🪴", "🌲", "🌳", "🌴", "🌵", "🌾", "🌿", "🍀", "🍁",
            "🍂", "🍃"
        ]
    },
    food: {
        fruit: [
            "🍇", "🍈", "🍉", "🍊", "🍋", "🍌", "🍍", "🥭", "🍎", "🍏",
            "🍐", "🍑", "🍒", "🍓", "🫐", "🥝", "🍅", "🫒", "🥥"
        ],
        vegetable: [
            "🥑", "🍆", "🥔", "🥕", "🌽", "🌶️", "🫑", "🥒", "🥬", "🥦",
            "🧄", "🧅", "🍄", "🥜", "🌰"
        ],
        prepared: [
            "🍞", "🥐", "🥖", "🫓", "🥨", "🥯", "🥞", "🧇", "🧀", "🍖",
            "🍗", "🥩", "🥓", "🍔", "🍟", "🍕", "🌭", "🥪", "🌮", "🌯",
            "🫔", "🥙", "🧆", "🥚", "🍳", "🥘", "🍲", "🫕", "🥣", "🥗",
            "🍿", "🧈", "🧂", "🥫"
        ],
        asian: [
            "🍱", "🍘", "🍙", "🍚", "🍛", "🍜", "🍝", "🍠", "🍢", "🍣",
            "🍤", "🍥", "🥮", "🍡", "🥟", "🥠", "🥡"
        ],
        marine: [
            "🦀", "🦞", "🦐", "🦑", "🦪"
        ],
        sweet: [
            "🍦", "🍧", "🍨", "🍩", "🍪", "🎂", "🍰", "🧁", "🥧", "🍫",
            "🍬", "🍭", "🍮", "🍯"
        ],
        drink: [
            "🍼", "🥛", "🫖", "🍵", "🍶", "🍾", "🍷", "🍸", "🍹", "🍺",
            "🍻", "🥂", "🥃", "🥤", "🧋", "🧃", "🧉", "🧊"
        ],
        dishware: [
            "🥢", "🍽️", "🍴", "🥄", "🔪", "🏺"
        ]
    },
    travel_places: {
        transport_ground: [
            "🚂", "🚃", "🚄", "🚅", "🚆", "🚇", "🚈", "🚉", "🚊", "🚝",
            "🚞", "🚋", "🚌", "🚍", "🚎", "🚐", "🚑", "🚒", "🚓", "🚔",
            "🚕", "🚖", "🚗", "🚘", "🚙", "🛻", "🚚", "🚛", "🚜", "🏎️",
            "🏍️", "🛵", "🦽", "🦼", "🛺", "🚲", "🛴", "🛹", "🛼", "🚏",
            "🛣️", "🛤️", "🛢️", "⛽", "🚨", "🚥", "🚦", "🛑", "🚧"
        ],
        transport_water: [
            "⚓", "⛵", "🛶", "🚤", "🛳️", "⛴️", "🛥️", "🚢",
        ],
        transport_air: [
            "✈️", "🛩️", "🛫", "🛬", "🪂", "💺", "🚁", "🚟", "🚠", "🚡",
            "🛰️", "🚀", "🛸"
        ]
    },
    activities: {
        sport: [
            "⚽", "⚾", "🥎", "🏀", "🏐", "🏈", "🏉", "🎾", "🥏", "🎳",
            "🏏", "🏑", "🏒", "🥍", "🏓", "🏸", "🥊", "🥋", "🥅", "⛳",
            "⛸️", "🎣", "🤿", "🎽", "🎿", "🛷", "🥌"
        ],
        game: [
            "🎯", "🪀", "🪁", "🎱", "🔮", "🪄", "🧿", "🎮", "🕹️", "🎰",
            "🎲", "🧩", "🧸", "🪅", "🪆", "🃏", "🀄", "🎴"
        ],
        arts_crafts: [
            "🎭", "🖼️", "🎨", "🧵", "🪡", "🧶", "🪢"
        ],
    }
};

export const emojisFlat = [].concat(
    emojisGrouped.animal.amphibian_reptile,
    emojisGrouped.animal.bird,
    emojisGrouped.animal.bug,
    emojisGrouped.animal.mammal,
    emojisGrouped.animal.marine,
    emojisGrouped.plant.flower,
    emojisGrouped.plant.other,
    emojisGrouped.food.asian,
    emojisGrouped.food.dishware,
    emojisGrouped.food.drink,
    emojisGrouped.food.fruit,
    emojisGrouped.food.marine,
    emojisGrouped.food.prepared,
    emojisGrouped.food.sweet,
    emojisGrouped.food.vegetable,
    emojisGrouped.travel_places.transport_air,
    emojisGrouped.travel_places.transport_ground,
    emojisGrouped.travel_places.transport_water,
    emojisGrouped.activities.arts_crafts,
    emojisGrouped.activities.game,
    emojisGrouped.activities.sport
);
