export const emojisGrouped = {
    animal: {
        mammal: [
            "🐵", "🐒", "🦍", "🦧", "🐶", "🐕", "🦮", "🐕‍🦺", "🐩", "🐺",
            "🦊", "🦝", "🐱", "🐈", "🐈‍⬛", "🦁", "🐯", "🐅", "🐆", "🐴",
            "🐎", "🦄", "🦓", "🦌", "🦬", "🐮", "🐂", "🐃", "🐄", "🐷",
            "🐖", "🐗", "🐽", "🐏", "🐑", "🐐", "🐪", "🐫", "🦙", "🦒",
            "🐘", "🦣", "🦏", "🦛", "🐭", "🐁", "🐀", "🐹", "🐰", "🐇",
            "🐿️", "🐿", "🦫", "🦔", "🦇", "🐻", "🐨", "🐼", "🦥", "🦦",
            "🦨", "🦘", "🦡", "🐾"
        ],
        bird: [
            "🦃", "🐔", "🐓", "🐣", "🐤", "🐥", "🐦", "🐧", "🕊", "🦅",
            "🦆", "🦢", "🦉", "🦤", "🪶", "🦩", "🦚", "🦜"
        ],
        amphibian_reptile: [
            "🐸", "🐊", "🐢", "🦎", "🐍", "🐲", "🐉", "🦕", "🦖"
        ],
        marine: [
            "🐳", "🐋", "🐬", "🦭", "🐟", "🐠", "🐡", "🦈", "🐙", "🐚"
        ],
        bug: [
            "🐌", "🦋", "🐛", "🐜", "🐝", "🪲", "🐞", "🦗", "🪳", "🕷️",
            "🕸️", "🦂", "🦟", "🪰", "🪱", "🦠"
        ]
    },
    plant: {
        flower: [
            "💐", "🌸", "💮", "🏵️", "🌹", "🥀", "🌺", "🌻", "🌼", "🌷"
        ],
        other: [
            "🌱", "🪴", "🌲", "🌳", "🌴", "🌵", "🌾", "🌿", "🍀", "🍁",
            "🍂", "🍃"
        ]
    },
    food: {
        fruit: [
            "🍇", "🍈", "🍉", "🍊", "🍋", "🍌", "🍍", "🥭", "🍎", "🍏",
            "🍐", "🍑", "🍒", "🍓", "🫐", "🥝", "🍅", "🫒", "🥥"
        ],
        vegetable: [
            "🥑", "🍆", "🥔", "🥕", "🌽", "🌶️", /*"🌶",*/ "🫑", "🥒", "🥬",
            "🥦", "🧄", "🧅", "🍄", "🥜", "🌰"
        ],
        prepared: [
            "🍞", "🥐", "🥖", "🫓", "🥨", "🥯", "🥞", "🧇", "🧀", "🍖",
            "🍗", "🥩", "🥓", "🍔", "🍟", "🍕", "🌭", "🥪", "🌮", "🌯",
            "🫔", "🥙", "🧆", "🥚", "🍳", "🥘", "🍲", "🫕", "🥣", "🥗",
            "🍿", "🧈", "🧂", "🥫"
        ],
        asian: [
            "🍱", "🍘", "🍙", "🍚", "🍛", "🍜", "🍝", "🍠", "🍢", "🍣",
            "🍤", "🍥", "🥮", "🍡", "🥟", "🥠", "🥡"
        ],
        marine: [
            "🦀", "🦞", "🦐", "🦑", "🦪"
        ],
        sweet: [
            "🍦", "🍧", "🍨", "🍩", "🍪", "🎂", "🍰", "🧁", "🥧", "🍫",
            "🍬", "🍭", "🍮", "🍯"
        ],
        drink: [
            "🍼", "🥛", "🫖", "🍵", "🍶", "🍾", "🍷", "🍸", "🍹", "🍺",
            "🍻", "🥂", "🥃", "🥤", "🧋", "🧃", "🧉", "🧊"
        ]
    }
};

export const emojisFlat = [].concat(
    emojisGrouped.animal.amphibian_reptile,
    emojisGrouped.animal.bird,
    emojisGrouped.animal.bug,
    emojisGrouped.animal.mammal,
    emojisGrouped.animal.marine,
    emojisGrouped.plant.flower,
    emojisGrouped.plant.other,
    emojisGrouped.food.asian,
    emojisGrouped.food.drink,
    emojisGrouped.food.fruit,
    emojisGrouped.food.marine,
    emojisGrouped.food.prepared,
    emojisGrouped.food.sweet,
    emojisGrouped.food.vegetable
);
